package com.example.module_news;

import androidx.lifecycle.ViewModel;

public class MyViewModel extends ViewModel {
    public String[] titleArray = {"知乎实验室",
            "知乎训练营",
            "创作者小助手",
            "知乎小伙伴",
            "知乎知物咖啡",
            "知乎校园",
            "知乎盐选会员"};
    public String[] textArray = {"亲爱的用户 ："  +
            "你好，为了更好了解你的互联网使用体验和偏好，诚邀你参加本次调研。「填写问卷」即可参与。\n" +
            "\n" + "你的每一个反馈都是我们进步的动力，真诚期待听到你的声音。\n" + "\n" + "知乎实验室",

            "想找高薪工作？想转行跳槽？想升职加薪？\n" + "\n" + "数据分析能力就是你的突破口\n" + "\n" +
                    "大数据时代风口技能，大厂高薪人才必修，掌握就能抓住高薪机会。\n" + "\n" +
                    ">>>「数据分析 3 天实战训练营」。\n" + "\n" + "数据专家手把手带你入门，文科生、0 基础小白也能快速掌握",

            "Hi 用户，\n" + "\n" + "恭喜你成为知乎创作者！\n" + "\n" +
                    "你刚在知乎提了一个问题，成功开启了你的创作之旅。点击「我的」-「创作中心」即可进入创作中心。\n" + "\n" +
                    "你还可以使用「创作中心」，让创作获得更多价值" + "\n" + "1.什么是知乎「创作中心」？\n" + "\n" +
                    "创作中心是你的专属创作工具，可以帮助你管理创作内容，获得更多认可，使用创作中心还有机会获得更多真金白银的收益。\n" +
                    "\n" + "2.在知乎创作可以收获哪些权益？\n" + "\n" + "a.盐选会员卡、读书卡、免费阅读券等会员福利。\n" ,

            "准备好了吗？\n" + "\n" + "如果你也喜欢手捧书本，执笔落字的感觉，欢迎参加《知乎零基础读书写作训练营》。\n" +
                    "\n" + "参加体验课你将获得\n" + "1 节直播写作课\n" + "2 次深度知识加餐\n" + "1 对 1 个人写作定位分析\n" +
                    "3 天学习社群陪伴督学\n" + "知乎变现规则和变现渠道全讲解\n" + "直播间抽送知乎周边实体礼品\n" + "\n" +
                    "还犹豫什么？快让你的爱好为你赚钱！",

            "亲爱的 用户 你好，\n" + "\n" + "双十一来袭，如何用最划算的方式喝到知乎知物咖啡？\n" + "\n" +
                    "11 月 1 日到 11 月 3 日期间，知乎知物天猫旗舰店进行双十一狂欢活动，全场咖啡折上立减，有买有送。\n" +
                    "\n" + "爆款咖啡，到手价低至 4.3 折；\n" + "多买多减，买 2 件折上再减 10 元，买 3 件折上再减 25 元；\n" +
                    "有买有送，买 2 件起就能获得便签本、便携水杯等刘看山周边；\n" + "多买多送，实付满 199 元再加送冷萃咖啡，知乎日历 2022 等赠品。",

            "叮咚～亲爱的用户 ：\n" + "\n" + "你的大学幸运词是什么？勇敢、热血还是......\n" +
                    "\n" + "截至 10 月 31 日，写回答、发文章、提问题就可参与创作打卡，还有机会拿千元锦鲤哦！\n" +
                    "\n" + "「更多奖励和规则戳我了解」\n" + "\n" + "和你一起开启新生活的知乎校园",

            "亲爱的 用户 你好：\n" + "\n" +
                    "你的读书卡权益还有 3 天就到期了，戳这里一键续费，继续畅听 600+ 本大咖领读音频，悦读 10000+ 严选电子书。\n" +
                    "\n" + "爱你的知乎盐选会员"};
}
